# One-to-Many and Many-to-Many Joins - Lab

## Introduction

In this lab, you'll practice your knowledge of one-to-many and many-to-many relationships!

## Objectives

You will be able to:
* Explain one-to-many and many-to-many joins as well as implications for the size of query results
* Query data using one-to-many and many-to-many joins

## One-to-Many and Many-to-Many Joins
<img src='images/Database-Schema.png' width="600">

## Connect to the Database

In [2]:
# Your code here
import sqlite3
import pandas as pd
conn = sqlite3.connect('data.sqlite')
cur = conn.cursor()

## Employees and their Office (a One-to-One join)

Return a DataFrame with all of the employees including their first name and last name along with the city and state of the office that they work out of (if they have one). Include all employees and order them by their first name, then their last name.

In [4]:
# Your code here
cur.execute('''SELECT firstName, lastName, city, state
                FROM employees
                JOIN offices
                USING(officeCode);''')
df = pd.DataFrame(cur.fetchall())
df.columns = [i[0] for i in cur.description]
print('Number of results:', len(df))
df.head()

Number of results: 23

  firstName   lastName           city state
0     Diane     Murphy  San Francisco    CA
1      Mary  Patterson  San Francisco    CA
2      Jeff   Firrelli  San Francisco    CA
3   William  Patterson         Sydney
4    Gerard     Bondur          Paris

## Customers and their Orders (a One-to-Many join)

Return a DataFrame with all of the customer contacts (first and last names) along with details for each of the customers' order numbers, order dates, and statuses.

In [6]:
# Your code here
cur.execute('''SELECT contactFirstName, contactLastName, orderNumber, orderDate, status
                FROM customers
                JOIN orders
                USING(customerNumber);''')
df = pd.DataFrame(cur.fetchall())
df.columns = [i[0] for i in cur.description]
print('Number of results:', len(df))
df.head()

Number of results: 326

  contactFirstName contactLastName  orderNumber   orderDate   status
0          Carine          Schmitt        10123  2003-05-20  Shipped
1          Carine          Schmitt        10298  2004-09-27  Shipped
2          Carine          Schmitt        10345  2004-11-25  Shipped
3             Jean            King        10124  2003-05-21  Shipped
4             Jean            King        10278  2004-08-06  Shipped

## Customers and their Payments (another One-to-Many join)

Return a DataFrame with all of the customer contacts (first and last names) along with details for each of the customers' payment amounts and date of payment. Sort these results in descending order by the payment amount.

In [8]:
# Your code here
# Your code here
cur.execute('''SELECT contactFirstName, contactLastName, paymentDate, amount
                FROM customers
                JOIN payments
                USING(customerNumber)
                ORDER BY amount DESC;''')
df = pd.DataFrame(cur.fetchall())
df.columns = [i[0] for i in cur.description]
print('Number of results:', len(df))
df.head()

Number of results: 273

  contactFirstName contactLastName paymentDate     amount
0           Diego           Freyre  2005-03-18  120166.58
1           Diego           Freyre  2004-12-31  116208.40
2            Susan          Nelson  2003-08-15  111654.40
3             Eric       Natividad  2003-12-26  105743.00
4            Susan          Nelson  2005-03-05  101244.59

## Orders, Order details, and Product Details (a Many-to-Many Join)

Return a DataFrame with all of the customer contacts (first and last names) along with the product names, quantities, and date ordered for each of the customers and each of their orders. Sort these in descending order by the order date.

> Note: This will require joining 4 tables! This can be tricky! Give it a shot, and if you're still stuck, turn to the next section where you'll see how to write subqueries that can make complex queries such as this much simpler!

In [14]:
# Your code here
cur.execute('''SELECT contactFirstName, contactLastName, productName, quantityOrdered, orderDate
                FROM orders
                JOIN customers
                USING(customerNumber)
                JOIN orderdetails
                USING(orderNumber)
                JOIN products
                USING(productCode)
                ORDER BY orderDate DESC
                
                ;''')
df = pd.DataFrame(cur.fetchall())
df.columns = [i[0] for i in cur.description]
print('Number of results:', len(df))
df.head()

Number of results: 2996

,contactFirstName,contactLastName,productName,quantityOrdered,orderDate
0,Diego,Freyre,1952 Alpine Renault 1300,50,2005-05-31
1,Diego,Freyre,1958 Setra Bus,49,2005-05-31
2,Diego,Freyre,1940 Ford Pickup Truck,54,2005-05-31
3,Diego,Freyre,1939 Cadillac Limousine,26,2005-05-31
4,Diego,Freyre,1996 Peterbilt 379 Stake Bed with Outrigger,44,2005-05-31

## Summary

In this lab, you practiced your knowledge of one-to-many and many-to-many relationships!